import React, { useState } from 'react';

const WILAYA_CHOICES = [
    ['الجزائر العاصمة', 'الجزائر العاصمة'],
    ['بومرداس', 'بومرداس'],
    ['البليدة', 'البليدة'],
    ['تيبازة', 'تيبازة'],
    ['تيزي وزو', 'تيزي وزو'],
    ['وهران', 'وهران'],
    ['قسنطينة', 'قسنطينة'],
    ['عنابة', 'عنابة'],
    ['سطيف', 'سطيف'],
    ['باتنة', 'باتنة'],
    ['ورقلة', 'ورقلة'],
    ['بشار', 'بشار'],
    ['أدرار', 'أدرار'],
    ['الأغواط', 'الأغواط'],
    ['بجاية', 'بجاية'],
    ['تلمسان', 'تلمسان'],
    ['تيارت', 'تيارت'],
    ['الجلفة', 'الجلفة'],
    ['سيدي بلعباس', 'سيدي بلعباس'],
    ['مستغانم', 'مستغانم'],
    ['الشلف', 'الشلف'],
    ['عين الدفلى', 'عين الدفلى'],
    ['غرداية', 'غرداية'],
    ['تمنراست', 'تمنراست'],
    ['إليزي', 'إليزي'],
    ['تندوف', 'تندوف'],
    ['النعامة', 'النعامة'],
    ['عين تموشنت', 'عين تموشنت'],
    ['غليزان', 'غليزان'],
    ['البيض', 'البيض'],
    ['ميلة', 'ميلة'],
    ['سوق أهراس', 'سوق أهراس'],
    ['أم البواقي', 'أم البواقي'],
    ['الطارف', 'الطارف'],
    ['خنشلة', 'خنشلة'],
    ['تبسة', 'تبسة'],
    ['جيجل', 'جيجل'],
    ['معسكر', 'معسكر'],
    ['المدية', 'المدية'],
    ['برج بوعريريج', 'برج بوعريريج'],
    ['الواد', 'الواد'],
    ['تيسمسيلت', 'تيسمسيلت'],
    ['عين صالح', 'عين صالح'],
    ['عين قزام', 'عين قزام'],
    ['تيميمون', 'تيميمون'],
    ['برج باجي مختار', 'برج باجي مختار'],
    ['أولاد جلال', 'أولاد جلال'],
    ['بني عباس', 'بني عباس'],
    ['توقرت', 'توقرت'],
    ['جانت', 'جانت'],
    ['المغير', 'المغير'],
    ['المنيعة', 'المنيعة']
];

const OptionWilaya = ({onWilayaChange}) => {
    const [selectedWilaya, setSelectedWilaya]=useState('')
    const handleChange=(event)=>{
        const newWilaya =event.target.value;
        setSelectedWilaya(newWilaya);
        onWilayaChange(newWilaya); 
    }
    return (
        <div>
            <label htmlFor="wilaya-select">Select your wilaya:</label>
            <select id="wilaya-select" value={selectedWilaya} onChange={handleChange}>
                <option>
                    choose your wilaya
                </option>
                {WILAYA_CHOICES.map(([value, label], index) => (
                    <option key={index} value={value}>
                        {label}
                    </option>
                ))}
            </select>
        </div>
    );
};

export default OptionWilaya;
